Documents/НакладнаяРасходная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>НакладнаяРасходная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПодпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>55</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Место</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДтДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДтМесто</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>строкаМесто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>55</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>сткМесто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>333</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Остатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачОст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рсх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолНаДату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолИнв</Name>
					<Comment>количество считанное другими планшетами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПредОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Забаланс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТоваров_</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ро_Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ро_ОчередьСТК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НакладнаяРасходная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем СекундБездействияМесто;

&НаСервере
Функция ПолучитьОСТ()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Остатки.Номенклатура КАК Номенклатура,
	               |	Остатки.Место КАК Место,
	               |	СУММА(Остатки.Количество) КАК Остаток
	               |ИЗ
	               |	РегистрСведений.Остатки КАК Остатки
	               |ГДЕ
	               |	Остатки.Склад = &Склад
	               |  и Забаланс = Ложь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |    Остатки.Место,
	               |	Остатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Склад",Объект.Склад);
	ЭтаФорма.ТблОст.Загрузить(Запрос.Выполнить().Выгрузить()); 
	

	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка)=Ложь Тогда
		Объект.ДатаСинхронизации = Дата(1,1,1);
	КонецеСЛИ;
	
	Если ЗначениеЗаполнено(Объект.Склад) =Ложь ТОгда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ top 1
		|	Остатки.Склад КАК Склад
		|ИЗ
		|	РегистрСведений.Остатки КАК Остатки
		|ГДЕ Остатки.Склад <> Значение(Справочник.Склады.ПустаяСсылка) и Забаланс = Ложь
		|УПОРЯДОЧИТЬ ПО
		|	Остатки.ДатаЗагрузки УБЫВ";
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() = Ложь Тогда
			Выб = Рез.Выбрать();
			Выб.Следующий();
			Объект.Склад = Выб.склад;
		КонецЕсли;
		
	КонецЕсли;
	
	//Подпись
	//Имя = ПолучитьИмяВременногоФайла("html");
	//Шаблон = Обработки.СделатьПодпись.ПолучитьМакет("ШаблонДокумента");
	//
	//
	//ТХТ = Новый ЗаписьТекста(Имя, "UTF-8");
	//ТХТ.Записать(Шаблон.Область(1,1).Текст);
	//ТХТ.Закрыть();
	//
	//ДокументHTML = Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Номенклатура,ИзмКол,Место,ШтрихКод,Производитель,ЗаменитьКол=Ложь)
	
	Стк = Новый Структура("Номенклатура,Место,ШтрихКод",Номенклатура,Место,ШтрихКод);
	
	Мас = Объект.Товары.НайтиСтроки(Стк);
	Если Мас.Количество()<>0 Тогда
		ТекСтр = Мас[0];
	Иначе
		ТекСтр = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекСтр,Стк);
		ТекСтр.Производитель = Производитель;
	КонецЕсли;
	
	ТекСтр.ДтДобавления = текущаяДата();
	
	Если ЗаменитьКол Тогда
		ТекСтр.Количество   = ИзмКол;
	Иначе
		ТекСтр.Количество   = ТекСтр.Количество + ИзмКол;
	КонецЕСЛИ;
	
	
	ЭтаФорма.Количество = ТекСтр.Количество;	
	ОтобразитьОстаток(Номенклатура);
	
	Объект.Товары.сортировать("ДтДобавления desc");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТхтОст(КонстантаСклад,текНом)
	ТБл = РегистрыСведений.Остатки.ПолучитьТблОстатки(КонстантаСклад,текНом);
	пСтр = "";
	Для каждого эл из ТБл Цикл
		Если эл.МЕсто = "" ТОгда
			пСтр = пСтр+"Б/места - "+Эл.Остаток+"; "	
		ИНаче
			пСтр = пСтр+Эл.Место+" - "+Эл.Остаток+"; "	
		КонецЕСлИ;
	Конеццикла;
	
	Возврат пСтр;
КонецФункции

&НаКлиенте
Процедура ОтобразитьОстаток(Номенклатура)
	
	пСтр = ПолучитьТхтОст(ОБъект.Склад,Номенклатура);
	
	ЭтаФорма.Остаток = пСтр;
	
Конецпроцедуры

&НаКлиенте
Процедура СказатьОшибка()
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ВоспроизвестиТекст("Ошибка!"); 
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСткМестоНаСервере(исхСтр)

	Стк = новый Соответствие();
	Текстр = СтрЗаменить(исхСтр,"@@@",Символы.ПС);
	
	Если СтрЧислоСтрок(Текстр)>1 Тогда
		Для а=1 по СтрЧислоСтрок(текСтр) Цикл
			пИмя = СтрПолучитьСтроку(ТекСтр,а);
			Если пИмя = "" Тогда Продолжить; КонецЕслИ;
			
			Попытка
				пЧс = СтрПолучитьСтроку(ТекСтр,а+1);
			Исключение
				Сообщить("Ошибка места число:"+СтрПолучитьСтроку(ТекСтр,а+1));
				продолжить;
			КонецПопытки;
			
			
			
			Стк.Вставить(пИмя,пЧс);
			а=а+1;
		Конеццикла;
	КонецЕСЛИ;
	
	Возврат Стк;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуСткМестоНаСервере(стк,стрМ,текСтрКол)
	стрМ = "";	
	СткСтр = "";
	итКол=0; итМ = "";
	Для каждого Эл из Стк Цикл
		Если эл.значение = 0 Тогда ПродолжитЬ; КонецЕСЛИ;
		сткСтр = сткСтр + эл.Ключ+"@@@"+Формат(эл.значение,"ЧГ=0")+"@@@";
		стрМ = стрМ+Эл.ключ+" - "+эл.Значение+Символы.ПС;
		итМ = Эл.Ключ;
		итКол = итКол+эл.Значение;
	КонецЦиклА;
	Если СтрЧислоСтрок(стрМ)=1 и итКол = текСтрКол Тогда
		стрМ = итМ;
	КонецеСЛИ;
	
	Возврат сткСтр;
КонецФункции


&НаКлиенте
Процедура ДобавитьМесто(Номенклатура,ИзмКол,Место,ШтрихКод)
	СекундБездействияМесто = 0;
	Если Место = 0 Тогда
		сказатьОшибка();
		Сообщить("Не указано место!");
		Возврат;
	КонецЕСЛИ;
	
	
	Стк = Новый Структура("Номенклатура,ШтрихКод",Номенклатура,ШтрихКод);
	
	Мас = Объект.Товары.НайтиСтроки(Стк);
	Если Мас.Количество()<>0 Тогда
		ТекСтр = Мас[0];
	Иначе
		СказатьОшибка();
		предупреждение("Нет нераспределенного количества!");
		Возврат;
	КонецЕсли;
	
	пМесто = ""+Формат(Место,"ЧГ=0");
	ТекКол = ТекСтр.Количество;
	
	Стк = ПолучитьСткМестоНаСервере(ТекСтр.сткМесто);
	Если Стк.Количество()<>0 Тогда
		Если Стк.Свойство(пМесто)=Истина Тогда
			Стк.Удалить(пМесто);
		КонецЕсли;
		
		Для каждого эл из Стк Цикл
			ТекКол = ТекКол - эл.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Если ИзмКол<>Неопределено Тогда
		ТекКол = Мин(ТекКол,измКол);
	КонецеСЛИ;	
		
	ЭтаФорма.Количество = ТекКол;	
	
	Стк.вставить(пМесто,ТекКол);
	пстр = "";
	ТекСтр.сткместо = ПолучитьСтрокуСткМестоНаСервере(стк,пСтр,текСтр.Количество);
	ТекСтр.строкаМесто = пСтр;
	ТекСтр.ДтМесто = текущаяДата();
	
	ОтобразитьОстаток(Номенклатура);
	
	Объект.Товары.сортировать("ДтМесто desc");
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	ТекНом = Неопределено;
	ШтрихКод = "";
	Производитель = Неопределено;
	ЕстьВвелиместо=Ложь;
	
	Если СокрЛП(Текст)="" Тогда Возврат; КонецеСЛИ;
	
	//Установка места
	Если Лев(Текст,3) = "(!)" Тогда
		ЭтаФорма.Место = Сред(Текст,4);
		#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ВоспроизвестиТекст("Место "+ЭтаФорма.Место); 
		#КонецЕсли
		Текст="";
		ЕстьВвелиместо = Истина;
	ИНаче
		ТекНом = глОбщий.НоменклатураАвтоПодборНаСервере(Текст,ШтрихКод,Производитель);
	КонецЕСЛИ;
	
	Если Элементы.ПоМестам.Пометка=Истина Тогда
		СекундБездействияМесто = 0;
		Текст = "";
		ЭтаФорма.СтрокаПодбора = "";

		Если ЭтаФорма.Место=0 Тогда
			СказатьОшибка();
			Предупреждение("Не выбрано место!");
			ТекНом = Неопределено;
		ИНачеЕсли ЕстьВвелиместо = Ложь Тогда
			Сигнал();
			ДобавитьМесто(ТекНом,Неопределено,ЭтаФорма.Место,ШтрихКод);
			ЭтаФорма.инвНоменклатура = текНом;
		КонецЕСЛИ;
		
		
	ИНачеЕсли ТекНом <> Неопределено Тогда
		Сигнал();
		Текст = "";
		ЭтаФорма.СтрокаПодбора = "";
		ЭтаФорма.инвНоменклатура = текНом;
		ЭтаФорма.инвШтрихКод = ШтрихКод;
		
		ДобавитьНоменклатуру(ТекНом,1,ЭтаФорма.Место,ШтрихКод,Производитель);
	КонецЕСЛИ;
		
	Если  ТекНом = Неопределено Тогда
		Если ЕстьВвелиместо = Ложь Тогда
			Предупреждение("Номенклатура не найдена!");
		КонецЕСЛИ;
		ЭтаФорма.СтрокаПодбора = Текст;
		ЭтаФорма.Количество    = 0;
		ЭтаФорма.инвШтрихКод = "";
		ЭтаФорма.инвНоменклатура = Неопределено;
	КонецеСЛИ;
	
	ОбновитьОтображениеДанныхФормы();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьОтображениеДанныхФормы()
	
	Элементы.Количество.ОбновитьТекстРедактирования();	
	//Элементы.Номенклатура.Обновить();
	
	#Если МобильноеПриложениеКлиент Тогда
		ЭтаФорма.ТекущийЭлемент = элементы.СтрокаПодбора;
		ЭтаФорма.НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если МобильноеПриложениеКлиент Тогда
		ПодключитьОбработчикОжидания("ФокусНаПодбор",2,Ложь);
	#КонецЕсли
	
	Если ЗначениеЗаполнено(Объект.ДатаСинхронизации) Тогда
		Этаформа.ТолькоПросмотр                = Истина;
		Элементы.СтрокаПодбора.Доступность     = Ложь;
		Элементы.ДатаСинхронизации1.Видимость  = Истина;
		Элементы.ФормаРазблокировать.Видимость = Истина;
	ИНаче
		Элементы.ФормаРазблокировать.Видимость = Ложь;
	КонецеСЛИ;
	
	ПолучитьОСТ();
	ВидДокументаПриИзменении();
	СекундБездействияМесто = 0;
	
	Если Объект.Товары.Количество()=0 и Объект.ДатаСинхронизации<>Дата(1,1,1) Тогда
		Элементы.ДекорацияНезагружено.Видимость = Истина;
	КонецеСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура КолПлюс(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма.инвНоменклатура)=Ложь Тогда ВозвраТ; КонецЕСЛИ;
	
	Если Команда.Имя = "КолМинус" Тогда
		Кол =  -1;
	Иначе
		Кол = 1;
	КонецЕсЛИ;
	
	Если Элементы.ПоМестам.Пометка Тогда
		ДобавитьМесто(ЭтаФорма.инвНоменклатура,Макс(0,ЭтаФорма.Количество+Кол),ЭтаФорма.Место,ЭтаФорма.ИнвШтрихКод);
	Иначе
		ДобавитьНоменклатуру(ЭтаФорма.инвНоменклатура,Кол,ЭтаФорма.Место,ЭтаФорма.ИнвШтрихКод,Неопределено);
	КонецеСЛИ;

	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ВоспроизвестиТекст(СокрЛП(ЭтаФорма.Количество)); 
	#КонецЕсли
	//Сигнал();
	//Если ОбновитьДанныеФормы Тогда
		ОбновитьОтображениеДанныхФормы();
	//КонецЕСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если ЗначениеЗаполнено(этаФорма.инвНоменклатура) Тогда
		//ЭтаФорма.Количество = ИзменитьКоличество(этаФорма.инвНоменклатура,ЭтаФорма.Количество,истина);
		
		Если Элементы.ПоМестам.Пометка Тогда
			ДобавитьМесто(ЭтаФорма.инвНоменклатура,ЭтаФорма.Количество,ЭтаФорма.Место,ЭтаФорма.ИнвШтрихКод);
		Иначе
			ДобавитьНоменклатуру(ЭтаФорма.инвНоменклатура,ЭтаФорма.Количество,ЭтаФорма.Место,ЭтаФорма.ИнвШтрихКод,Неопределено,Истина);
		КонецЕслИ;
		
		Сигнал();
	ИНаче
		ЭтаФорма.Количество = 0;
	КонецЕСЛИ;
	ОбновитьОтображениеДанныхФормы();
КонецПроцедуры

&НаКлиенте
Процедура ФокусНаПодбор()
	
	Если ЭтаФорма.ТолькоПросмотр = Истина ТОгда Возврат; КонецеСЛИ;
	
	СекундБездействияМесто = СекундБездействияМесто+1;
	Если СекундБездействияМесто > 25 Тогда
		ЭтаФорма.Место = 0;
		СекундБездействияМесто = 0;
	КонецЕслИ;
	
	Если ТипЗнч(ЭтаФорма.ТекущийЭлемент)=Тип("ПолеФормы") Тогда
		Если ЭтаФорма.ТекущийЭлемент.Имя = "СтрокаПодбора" Тогда
			ЭтаФорма.НачатьРедактированиеЭлемента();
			Возврат;
		ИНачеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "Количество" 
			  или ЭтаФорма.ТекущийЭлемент.Имя = "Место"
			  или ЭтаФорма.ТекущийЭлемент.Имя = "МестоИсточник"
			  или ЭтаФорма.ТекущийЭлемент.Имя = "Склад"
			  или ЭтаФорма.ТекущийЭлемент.Имя = "ВидДокумента"
			  Тогда
			Возврат;
		КонецЕСЛИ;
	КонецЕСЛИ;
	
	ЭтаФорма.ТекущийЭлемент = элементы.СтрокаПодбора;
	ЭтаФорма.НачатьРедактированиеЭлемента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ДДКартины = СтрЗаменить(ДанныеСобытия.href,"data:image/png;base64,","");	
	ДД = Base64Значение(ДДКартины);
	пп = ПоместитьВоВременноеХранилище(ДД);
	ЭтаФорма.РезультатПодпись = пп;
	Сообщить(пп);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(РезультатПодпись)
	Обк = РеквизитФормыВЗначение("Объект");
	//    Обк.ХранилищеПодпись = новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(РезультатПодпись));
	Обк.Проведен = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Товары.сортировать("ДтДобавления desc");

	ПередЗаписьюНаСервере(ЭтаФорма.РезультатПодпись);
	
	Если Объект.ВидДокумента=ВидДокументаСменаМеста() Тогда
		Для а=-Объект.ТОвары.Количество() по -1 Цикл
			ТекСтр = Объект.Товары[-а-1];
			
			пКол = 0;
			Стк = ПолучитьСткМестоНаСервере(ТекСтр.сткМесто);
			Если Стк.Количество()<>0 Тогда
				Для каждого эл из Стк Цикл
					пКол = пКол + эл.Значение;
				КонецЦикла;
			КонецЕсли;
			
			Если пКол=0 Тогда
				Объект.ТОвары.Удалить(ТекСтр);
			ИНаче
				ТекСтр.Количество = пКол;
			КонецЕСЛИ;
			
		Конеццикла;
	КонецЕслИ;
	
	Объект.ДатаСинхронизации = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	Если ЭтаФорма.Модифицированность = Истина Тогда
		Сообщить("Документ не записан!");
		Возврат;
	КонецеСЛИ;
	глВыгрузкаДанных.ВыгрузитьДокумент(объект.Ссылка);
	ОповеститьОбИзменении(объект.Ссылка);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ПолучитьОСТ();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетки(Команда)
	Если Команда.имя = "ПечатьЭтикеткиСУказаниемПринтера" Тогда
		глОбщийКлиент.ПечатьЭтикетки(ЭтаФорма.инвНоменклатура,Истина);
	ИНаче
		глОбщийКлиент.ПечатьЭтикетки(ЭтаФорма.инвНоменклатура);
	КонецЕСЛИ;

КонецПроцедуры

&НаКлиенте
Процедура Разблокировать(Команда)
	Если ПолучитьДанныеССервераПоДокументу() = Ложь Тогда Возврат; КонецеслИ;
	Этаформа.ТолькоПросмотр = Ложь;
	Элементы.СтрокаПодбора.Доступность = Истина;
	Элементы.ДекорацияНезагружено.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеССервераПоДокументу()
	
	Тбл = глВыгрузкаДанных.ПолучитьДанныеПоДокументу(Объект.Ссылка);
	Если Тбл = Неопределено Тогда
		Возврат Ложь;
	КонецЕСЛИ;
	
	Для а=-Объект.Товары.Количество() по -1 Цикл
		стОбк = Объект.Товары[-а-1];
		Мас = Тбл.НайтиСтроки(Новый Структура("НомGUID",СокрЛП(стОбк.Номенклатура.УникальныйИдентификатор())));
		
		итКол = стОбк.Количество;
		Для каждого Эл из Мас Цикл
			Если итКол = 0 Тогда Прервать; КонецЕСЛИ;
			Если Эл.Количество = 0 Тогда ПродолжитЬ; КонецЕслИ;
			п = Мин(итКол,Эл.Количество);
			Эл.Количество = Эл.Количество - п;
			итКол = итКол - п;
		КонецЦикла;
		
		стОбк.Количество = стОбк.Количество - итКол;
		Если стОбк.Количество=0 Тогда
			объект.Товары.Удалить(-а-1);
		КонецеСЛИ;
		
	КонецЦикла;
	
	Для каждого Стр из Тбл Цикл
		Если Стр.Количество=0 Тогда Продолжить; КонецЕСЛИ;
		ТекСтр = Объект.Товары.Добавить();
		ТекСтр.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.НомGUID));
		ТекСтр.Количество = Стр.Количество;
	Конеццикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтаФорма.ТолькоПросмотр = Истина ТОгда Возврат; КонецеСЛИ;
	
	ТекСтр = Элементы.Товары.текущиеДанные;
	ЭтаФорма.инвНоменклатура = текСтр.Номенклатура;
	ЭтаФорма.инвШтрихКод = текСтр.ШтрихКод;
	Этаформа.Количество = ТекСтр.Количество;
	Если Элементы.ПоМестам.Пометка = истина Тогда
		ЭтаФорма.Место = 0;
	ИНаче
		ЭтаФорма.Место = ТекСтр.Место;
	КонецеСЛИ;
КонецПроцедуры

&НаКлиенте
Процедура ПоМестам(Команда)
	ЭтаФорма.Место = 0;
	Если Элементы.ПоМестам.Пометка Тогда
		ВидимостьМеста(Ложь);
	ИНАче
		ВидимостьМеста(Истина);
	КонецЕСЛИ;
	//Элементы.ПоМестам.Пометка = 1-Элементы.ПоМестам.Пометка;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидДокументаПоступление()
	Возврат Перечисления.ВидДокумента.ПоступлениеТоваровУслуг;
КонецФункции

&НаСервереБезКонтекста
Функция ВидДокументаРеализация()
	Возврат Перечисления.ВидДокумента.РеализацияТоваровУслуг;
КонецФункции

&НаСервереБезКонтекста
Функция ВидДокументаСменаМеста()
	Возврат Перечисления.ВидДокумента.ПеремещениеТоваров_;
КонецФункции

&НаКлиенте
Процедура ВидимостьМеста(НадоПоМестам=Ложь)
	
	Если Объект.ВидДокумента = ВидДокументаПоступление() Тогда
		Элементы.ПоМестам.Видимость = Истина;
	Иначе
		Элементы.ПоМестам.Видимость = Ложь;
	КонецЕСЛИ;
	
	Если Объект.ВидДокумента = ВидДокументаСменаМеста() Тогда
		НадоПоМестам = Истина;
		Элементы.ПоМестам.Пометка=Истина;
		Элементы.МестоИсточник.Видимость = Истина;
		Элементы.Товары.ИзменятьПорядокСтрок=Ложь;
		Элементы.Товары.ИзменятьСоставСтрок=Ложь;
	ИНАче
		Элементы.МестоИсточник.Видимость = Ложь;
		Элементы.Товары.ИзменятьПорядокСтрок=Истина;
		Элементы.Товары.ИзменятьСоставСтрок=Истина;
	КонецеСЛИ;
	
	
	Если НадоПоМестам=Истина Тогда
		Элементы.ПоМестам.ЦветФона = WebЦвета.Пшеничный;
		Элементы.ПоМестам.Пометка = Истина;
	Иначе
		Элементы.ПоМестам.ЦветФона = новый Цвет;
		Элементы.ПоМестам.Пометка = Ложь;
	КонецеСЛИ;
	
	Элементы.Место.Видимость = НадоПоМестам;
	
	
	Элементы.грпРеа.Видимость = Объект.ВидДокумента = ВидДокументаРеализация();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьМесто(Команда)
	Если ЗначениеЗаполнено(ЭтаФорма.инвНоменклатура)=Ложь Тогда ВозвраТ; КонецЕСЛИ;
	Стк = Новый Структура("Номенклатура,ШтрихКод",ЭтаФорма.инвНоменклатура,ЭтаФорма.ИнвШтрихКод);
	
	Мас = Объект.Товары.НайтиСтроки(Стк);
	Если Мас.Количество()<>0 Тогда
		ТекСтр = Мас[0];
		ТекСтр.СтрокаМесто = "";
		ТекСтр.сткМесто = "";
		ОбновитьОтображениеДанныхФормы();
	КонецесЛи;
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент=Неопределено)
	ВидимостьМеста();
	ЭтаФорма.Заголовок = ""+Объект.ВидДокумента+" №"+СокрЛП(Объект.Номер)+" от "+Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
КонецПроцедуры

&НаСервере
Процедура МестоИсточникПриИзмененииНаСервере()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Остатки.Номенклатура КАК Номенклатура,
	               |	СУММА(Остатки.Количество) КАК Количество
	               |ИЗ
	               |	РегистрСведений.Остатки КАК Остатки
	               |ГДЕ
	               |	Остатки.Место = &Место
	               |  и Забаланс = Ложь
	               |СГРУППИРОВАТЬ ПО
	               |	Остатки.Номенклатура
	               |
				   |HAVING СУММА(Остатки.Количество)<>0
				   |";
	
	Запрос.УстановитьПараметр("Место",Объект.МестоИсточник);
	ТБл = Запрос.Выполнить().Выгрузить();
	Объект.Товары.Загрузить(Тбл);
	
	
КонецПроцедуры

&НаКлиенте
Процедура МестоИсточникПриИзменении(Элемент)
	
	Если Лев(Сокрлп(Объект.МестоИсточник),3) = "(!)" Тогда
		Объект.МестоИсточник = Сред(Сокрлп(Объект.МестоИсточник),4);
	КонецЕСЛИ;
	
	Если ОБъект.Товары.Количество()<>0 ТОгда
		Сообщить("Перед сменой места нужно очистить таблицу с ТМЦ");
		Возврат;
	КонецЕСЛИ;
	МестоИсточникПриИзмененииНаСервере();
	ЭтаФорма.ТекущийЭлемент = элементы.СтрокаПодбора;
	ЭтаФорма.НачатьРедактированиеЭлемента();
КонецПроцедуры
	
&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	оо = Новый ОписаниеОповещения("ОтветНаВопросОчиститьТаблицу",ЭтотОбъект);
	ПоказатьВопрос(оо,"Табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура  ОтветНаВопросОчиститьТаблицу(Рез,Пар) Экспорт
	
	Если Рез = КодВозвратаДиалога.Да ТОгда
		Объект.Товары.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоПриИзменении(Элемент)
	СекундБездействияМесто = 0;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ВидДокументаПриИзменении();
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры
